Repository: RoboCupHSJL/elsiros
Catalog: docs/locales/*/LC_MESSAGES/intro.po
Languages: ru

source: ELSIROS INTRO
ru: Введение в ELSIROS

source: Soccer game of Humanoid robots is becoming popular between teams in education and academic society. This type of competitions generates many scientific research points. For students in high schools, colleges or universities in general there are 3 obstacles preventing them to set up and maintain a humanoid robot soccer team:
ru: Игра в футбол человекоподобными роботами (гуманоидами) становится популярным в университетском и научном сообществе. Этот вид соревнований является источником для большого количества научно – прикладных исследований. Для учеников школ, колледжей и студентов в общем можно сформулировать 3 основных препятствия для создания и поддержания команды из роботов-гуманоидов-футболистов:

source: extremely high price of humanoid robots,
ru: Слишком высокая цена роботов – гуманоидов,

source: too complex algorithmic problems to be solved at initial steps of setting robot into game,
ru: Слишком сложные алгоритмические задачи, которые необходимо решить на начальном этапе включения робота в игру,

source: small number of teams in one geographical location – means every game is possible only together with travelling to far distance with relatively high travel charges.
ru: игра возможна только в комбинации с поездкой на дальние расстояния с относительно большими расходами на командировку.

source: All 3 obstacles can be eliminated if teams start their Humanoid Soccer experience from ELSIROS. Following advantages are obtained with using ELSIROS:
ru: Все 3 препятствия можно избежать, если новая команда начинает приобретать опыт футбола гуманоидов с ELSIROS. Используя ELSIROS, можно воспользоваться следующими преимуществами:

source: ELSIROS is free of charge and open source.
ru: ELSIROS полностью бесплатный и с открытым кодом.

source: Most difficult parts of humanoid robot development which are beyond of school or college program like Inverse Kinematics, walking engine, path planning, detecting of ball and obstacles and localization are provided readymade in source codes. Example of playing strategy which proved to be a leading strategy at games of real robots is provided for study and improvement.
ru: Самые трудные части освоения гуманоидных роботов, которые выходят за рамки программы школы и колледжей, такие как обратная кинематика, генератор ходьбы, планирование траекторий, детекция мяча и препятствий и локализация обеспечены в готовом виде с предоставлением исходного кода. Пример стратегии игры, который был доказан как успешный на играх реальных роботов предоставляется для изучения и дальнейшего совершенствования.

source: In order to participate in competitions or challenges it is not necessary to travel. Participating teams can compile their source code into executable binary code which is safe against source code leaking and upload to referees server.
ru: Для участия в соревнованиях и товарищеских играх нет необходимости в командировках. Команды – участники могут скомпилировать свой исходный код в исполняемый бинарный код, который обеспечен защитой от копирования алгоритмов, и выгрузить его на сервер судьи.

source: Teams don’t suffer from backlashes, mis-tunings, mis-calibrations because models are tuned, calibrated and free of backlashes.
ru: Команды не испытывают проблем с люфтами сервомоторов, разрегулировкой, раскалибровкой, так как виртуальная модель предоставляется без люфтов, отрегулированной и откалиброванной.

source: Strategy modules developed by teams will be ready to be used on real robots which teams may decide to build or to buy from market in future.
ru: Модули стратегии, которые будут создавать команды в дальнейшем готовы к использованию на физических роботах, которые команды могут захотеть построить сами или приобрести готовыми.

source: It is not necessarily powerful servers for running training games, simulation can run even at laptop.
ru: Для симуляции тренировочных игр не требуется мощных серверов, симуляцию игры можно запустить даже на портативном компьютере.

source: Webots simulator (to be downloaded from vendors’ site);
ru: Симулятор Webots (скачивается с сайта разработчика);

source: Primary robot model, which is a virtual model of existing physical robot – a winner of international humanoid soccer challenges in 2019, 2020 and 2021 used by team “Robokit”;
ru: Первоначальная модель робота, которая является виртуальной моделью физически существующего робота – победителя международных соревнований футбола гуманоидных роботов в 2019, 2020 и 2021 годах, использовавшийся командой «Robokit»;

source: Soccer simulation environment for simulator;
ru: Виртуальное окружение симулятора в виде футбольного поля;

source: Autonomous/Human referee program and game controller;
ru: Программа судьи, действующего Автономно или под управлением человека, а также программа управления игрой (game controller);

source: Robot controller software pack capable to play games;
ru: Пакет программ управления виртуальным роботом, обеспечивающий игру в футбол;

source: Medium level developers can try to improve launcher.py module. This module stands for detecting game state, player state and team state, managing players role and their starting positions. Advanced developers can try to modify other modules of source code which are responsible for inverse kinematics, motion, localization, robots’ path planning.
ru: Программисты среднего уровня могут пробовать изменять модуль launcher.py. Этот модуль отвечает за детекцию состояния игры, состояния игрока, управление ролями игроков и их начальных позиций.

source: Expert level developers are allowed to compose their own model of robot and use their own controller software with or without using source code included into ELSIROS open-source package. In order to be admitted to competition program team providing virtual model of their own robot design have to be qualified. Main requirement to robot model is that virtual model and real robot must have the same technical performance in all details. Special requirements to robots’ PROTO which appear from simulation environment can be sent after special request.
ru: Специалисты экспертного уровня могут собрать свою модель робота и использовать свои программы управления роботом, решая сами пользоваться или не пользоваться исходным кодом, который предоставлен разработчиками ELSIROS. Для допуска к соревнованиям команда, предоставляющая свою собственную виртуальную модель робота, должна пройти квалификацию модели робота. Основное требование к модели робота состоит в том, что модель должна иметь такие же технические характеристики, как и физический робот. Специальные требования к PROTO модели, которые следуют исходя из свойств виртуальной среды, могут быть высланы по запросу.

source: If you are a mentor of potential Humanoid Robot Soccer team you can easily start-up with your team. It is necessary simply download and install ELSIROS in your computer. There is executable version for Windows 10 or source code for Linux. Please follow instructions and sample code will play soccer just after installation. Please use your favorite Python 3 IDE for improving players’ source code and you are ready to Virtual Humanoid Robot Soccer challenges in simulation. You can train your games at your laptop computer.
ru: Если вы руководитель потенциальной команды, которая хочет играть в футбол гуманоидными роботами, то вы можете самостоятельно начинать без особых трудностей. Необходимо скачать и установить ELSIROS на ваш компьютер. На выбор есть версия в исполняемых файлах для Windows 10 или версия для самостоятельной сборки для Linux. Следуйте инструкциям по установке и программа, приведенная как пример, начнет играть в футбол сразу после установки. Используйте вашу предпочитаемую среду разработки программ Python 3 для улучшения исходного кода игры игрока и вы уже готовы к виртуальным соревнованиям в футбол гуманоидных роботов в симуляции. Вы можете проводить тренировочные игры на своем переносном компьютере.
